app/Http/Controllers/Auth/RegisterController.php

insert into `listas` (`title`, `user_id`, `updated_at`, `created_at`) values ('Favoritos', 2, '2020-05-19 10:05:25', '2020-05-19 10:05:25')
---
    protected function createFavorite($user)
    {
        $lista = new Lista();
        $lista->title = "Favoritos";
        $lista->user_id = $user->id;

        $lista->save();