app/Http/Controllers/HomeController.php

select * from `posts` order by `created_at` desc limit 3 offset 0
select count(*) as aggregate from `posts`
select * from `posts` order by RAND() limit 10
---
    public function showHome(){
        //paginate() sólo se puede usar sobre una query, no una Collection
        $posts = Post::paginate(3)->sortByDesc('created_at');

        $random_posts = DB::table('posts')
            ->inRandomOrder()
            ->take(10)
            ->get();