app/Http/Controllers/ListasController.php

    public function createFavorite($postId)
    {
        $user_id = Auth::user()->id;
        $lista = Lista::where('user_id','=', $user_id)->firstOrFail();
        $lista->posts()->attach($postId);
---
select * from `listas` where `user_id` = 2 limit 1
insert into `lista_post` (`lista_id`, `post_id`) values (2, '1')