app/Http/Controllers/PostController.php

insert into `posts` (`title`, `private`, `text`, `user_id`, `updated_at`, `created_at`) values ('Integra una barra de depuración a Laravel', 0, 'Como cualquier paquete de Laravel, instalar Laravel Debugbar es muy fácil:\r\n\r\nSolo debemos instalar el paquete usando Composer. En la terminal ejecuta el siguiente comando:\r\n\r\ncomposer require barryvdh/laravel-debugbar --dev\r\n\r\nSi estás utilizando Laravel 5.5 o superior la característica de Package Discovery registrará el Service Provider y Facade por ti, de lo contrario debes:\r\n\r\nAgregar el Service Provider en config/app.php:', 2, '2020-05-19 10:07:01', '2020-05-19 10:07:01')
insert into `archivos` (`name`, `type`, `icon`, `path`, `user_id`, `post_id`, `updated_at`, `created_at`) values ('erin1.png', 'image', '<i class=\"fas fa-file-image\"></i>', 'public/user-2/1UfNEiqeG2yGNgGK6PncAs7GEoYst4f6TUgCWq5K.png', 2, 2, '2020-05-19 10:07:02', '2020-05-19 10:07:02')
---
    public function createPost(Request $request) {

        $post = new Post();
        $post->title=$request->input("title");
        $post->private=$request->input("private")?1:0;
        $post->text=$request->input("description");
        $post->user_id=auth()->id();

        $post->save();

        $file = new Archivo();
        $file->name=$request->file("file")->getClientOriginalName();

        $file->path=$request->file("file")->store("public");
        $file->user_id=auth()->id();
        $file->post_id=$post->id;

        $file->save();