app/Http/Controllers/ProfileController.php

update `users` set `email` = 'editandoelemail@papaya.com', `description` = '', `users`.`updated_at` = '2020-05-19 11:02:47' where `id` = 2
---
    public function update(Request $request, User $user)
    {
        if (isset($request->email)){
            $user->email = $request->email;
        }
        if(isset($request->description)){
            $user->description = $request->description;
        }
        $user->save();